---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachJustificationParam
source: html/aaff05f2-e14e-1454-ae6b-4deb399b20f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachJustificationParam Property

"Attachment Justification At Top"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnTopAttachJustificationParam { get; }
```